20150218_MSR/index.org
#+Title: The Lean Theorem Prover
#+Author: [[http://leodemoura.github.io][Leonardo de Moura]] (joint work with Soonho Kong, Jeremy Avigad, Floris van Doorn, Jakob von Raumer)
#+Date:  Microsoft Research, 2015/02/18
#+REVEAL_HLEVEL: 3
#+REVEAL_TRANS: none
#+REVEAL_THEME: soonho

#+OPTIONS: toc:nil reveal_mathjax:t num:nil reveal_center:nil reveal_control:t reveal_overview:t reveal_history:t reveal_progress:t
#+OPTIONS: reveal_rolling_links:nil
#+OPTIONS: reveal_width:1000 reveal_height:800
#+REVEAL_MIN_SCALE: 1.0
#+REVEAL_MAX_SCALE: 1.0
#+REVEAL_ACE_THEME: ace/theme/chrome
#+REVEAL_ACE_FONTSIZE: 20px

* Introduction: *Lean*

- New *automated* & *interactive* theorem prover
- Powerful system for
  - reasoning about *complex systems*
  - reasoning about *mathematics*
  - proving claims about *both*
- de Bruijn's Principle: *small trusted kernel*

* Introduction: *Lean*

- *Proving* should be as easy as *programming*
- Expressive logic
- Partial constructions: automation fills the "holes"

* Introduction: *Lean*

- Platform for
  - *Software* verification & development
  - Formalized *mathematics*
  - *Education* (mathematics, logic, computer science)
  - *Synthesis* (proofs & programs)

* Introduction: *Lean*

- It is an ongoing and *long term* effort
- At CMU, it is already being used for formalizing
  - Homotopy Type Theory
  - Category Theory
  - Algebraic Hierarchy
- [[http://leanprover.github.io/tutorial][Interactive theory proving course]] at CMU

* What is new?

- Poweful *elaboration engine* that can handle
  - Higher-order unification
  - Definitional reductions
  - Coercions
  - Ad-hoc polymorphism (aka overloading)
  - Type classes
  - Tactics (the automation gateway)
  - *in an integrated way*

* What is new?

- Poweful *elaboration engine* that can handle
- Small *trusted* kernel: it does *not* contain
  - Termination checker
  - Fixpoint operators
  - Pattern matching

* What is new?

- Poweful *elaboration engine* that can handle
- Small *trusted* kernel
- *Flexible* kernel
  - Proof irrelevance is optional
  - Extensible (e.g., future support for HITs)

* What is new?

- Poweful *elaboration engine* that can handle
- Small *trusted* kernel
- *Flexible* kernel
- Multi-core support
  - Process theorems in parallel
  - Execute/try tactics (automation) in parallel

* What is new?

- Poweful *elaboration engine* that can handle
- Small *trusted* kernel
- *Flexible* kernel
- Multi-core support
- *Incremental compilation*

* What is new?

- Poweful *elaboration engine* that can handle
- Small *trusted* kernel
- *Flexible* kernel
- Multi-core support
- *Incremental compilation*
- Universe polymorphism

* What is new?

- Poweful *elaboration engine* that can handle
- Small *trusted* kernel
- *Flexible* kernel
- Multi-core support
- *Incremental compilation*
- Universe polymorphism
- *Freedom to trust*
  - Support for "macros" (procedural attachments to kernel)
  - Every "macro" can be *eliminated*
  - Faster type checking and reduction

* What is new?

- Poweful *elaboration engine* that can handle
- Small *trusted* kernel
- *Flexible* kernel
- Multi-core support
- *Incremental compilation*
- Universe polymorphism
- *Freedom to trust*
- Support for *mixed* declarative and tactic *proof style*
- Future: *powerful automation*


* What is new?

- Poweful *elaboration engine* that can handle
- Small *trusted* kernel
- *Flexible* kernel
- Multi-core support
- *Incremental compilation*
- Universe polymorphism
- *Freedom to trust*
- Support for *mixed* declarative and tactic *proof style*
- Future: *powerful automation*

* The Logical Framework

- *First layer*: dependent lambda calculus

#+BEGIN_SRC lean
Type                      -- Sort
nat                       -- Constant
λ x : nat, x              -- Lambda abstraction
vector bool 3             -- Application
Π (n : nat), vector nat n -- Function Space
nat → bool                -- Function Space (no dependency)
#+END_SRC

* The Logical Framework

- *First layer*: dependent lambda calculus

#+BEGIN_SRC lean
definition f (A B : Type) : A → B → A :=
λ (a : A) (b : B), a

definition f (A B : Type) (a : A) (b : B) : A :=
a
#+END_SRC

* The Logical Framework

- *First layer*: dependent lambda calculus
- Hierarchy of universes

#+BEGIN_SRC lean
set_option pp.universes true
check Type.{0}  -- Prop     : Type.{1}
check Type.{1}  -- Type.{1} : Type.{2}
check Type.{2}  -- Type.{2} : Type.{3}
#+END_SRC

* The Logical Framework

- *First layer*: dependent lambda calculus
- Hierarchy of universes
- *Prop* is the type of all *propositions*

#+BEGIN_SRC lean
theorem f (A B : Prop) : A → B → A :=
λ (a : A) (b : B), a

theorem f (A B : Prop) (a : A) (b : B) : A :=
a
#+END_SRC

* The Logical Framework

- *First layer*: dependent lambda calculus
- Hierarchy of universes
- *Prop* is the type of all *propositions*
- *Configurable*
  - Impredicative *Prop*
  #+BEGIN_SRC lean
  Π (x : nat), x = x  -- is a Proposition
  ∀ (x : nat), x = x  -- Alternative notation
  #+END_SRC
  - Proof irrelevance
  #+BEGIN_SRC lean
  example (p : Prop) (H₁ : p) (H₂ : p) : H₁ = H₂ :=
  rfl -- reflexivity
  #+END_SRC

- We have *two flavors*
  - Standard (CoC): uses an impredicative and proof irrelevant *Prop*
  - HoTT: proof relevant, and *no Prop*

* The Logical Framework

- *First layer*: dependent lambda calculus
- Hierarchy of universes
- *Prop* is the type of all *propositions*
- *Configurable*
- We have *two flavors*
- *Second layer*: inductive families
  - We "believe" in recursion
  #+BEGIN_SRC lean
  inductive vector (A : Type) : nat → Type :=
  | nil  : vector A zero
  | cons : Π {n : nat}, A → vector A n → vector A (succ n)
  #+END_SRC

