20150218_MSR/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>The Lean Theorem Prover</title>
<meta name="author" content="((link (:type http :path //leodemoura.github.io :raw-link http://leodemoura.github.io :application nil :search-option nil :begin 1 :end 52 :contents-begin 32 :contents-end 49 :post-blank 1 :parent #0) Leonardo de Moura) (joint work with Soonho Kong, Jeremy Avigad, Floris van Doorn, Jakob von Raumer))"/>

<link rel="stylesheet" href="//leanprover.github.io/presentations/reveal.js-3.0.0/css/reveal.css"/>
<link rel="stylesheet" href="//leanprover.github.io/presentations/reveal.js-3.0.0/css/theme/soonho.css" id="theme"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->

<link rel="import" href="./juicy-ace-editor.html">
<link rel="stylesheet" href="../css/code.css">
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<h1 id='title-name'>The Lean Theorem Prover</h1>
<h2 id='author-list'><a href="http://leodemoura.github.io">Leonardo de Moura</a> (joint work with Soonho Kong, Jeremy Avigad, Floris van Doorn, Jakob von Raumer)</h2>
<h2 id='date'>Microsoft Research, 2015/02/18</h2>
</section>

<section id="sec-1" >

<h2>Introduction: <b>Lean</b></h2>
<ul class="org-ul">
<li>New <b>automated</b> &amp; <b>interactive</b> theorem prover
</li>
<li>Powerful system for
<ul class="org-ul">
<li>reasoning about <b>complex systems</b>
</li>
<li>reasoning about <b>mathematics</b>
</li>
<li>proving claims about <b>both</b>
</li>
</ul>
</li>
<li>de Bruijn's Principle: <b>small trusted kernel</b>
</li>
</ul>

</section>
<section id="sec-2" >

<h2>Introduction: <b>Lean</b></h2>
<ul class="org-ul">
<li><b>Proving</b> should be as easy as <b>programming</b>
</li>
<li>Expressive logic
</li>
<li>Partial constructions: automation fills the "holes"
</li>
</ul>

</section>
<section id="sec-3" >

<h2>Introduction: <b>Lean</b></h2>
<ul class="org-ul">
<li>Platform for
<ul class="org-ul">
<li><b>Software</b> verification &amp; development
</li>
<li>Formalized <b>mathematics</b>
</li>
<li><b>Education</b> (mathematics, logic, computer science)
</li>
<li><b>Synthesis</b> (proofs &amp; programs)
</li>
</ul>
</li>
</ul>

</section>
<section id="sec-4" >

<h2>Introduction: <b>Lean</b></h2>
<ul class="org-ul">
<li>It is an ongoing and <b>long term</b> effort
</li>
<li>At CMU, it is already being used for formalizing
<ul class="org-ul">
<li>Homotopy Type Theory
</li>
<li>Category Theory
</li>
<li>Algebraic Hierarchy
</li>
</ul>
</li>
<li><a href="http://leanprover.github.io/tutorial">Interactive theory proving course</a> at CMU
</li>
</ul>

</section>
<section id="sec-5" >

<h2>What is new?</h2>
<ul class="org-ul">
<li>Poweful <b>elaboration engine</b> that can handle
<ul class="org-ul">
<li>Higher-order unification
</li>
<li>Definitional reductions
</li>
<li>Coercions
</li>
<li>Ad-hoc polymorphism (aka overloading)
</li>
<li>Type classes
</li>
<li>Tactics (the automation gateway)
</li>
<li><b>in an integrated way</b>
</li>
</ul>
</li>
</ul>

</section>
<section id="sec-6" >

<h2>What is new?</h2>
<ul class="org-ul">
<li>Poweful <b>elaboration engine</b> that can handle
</li>
<li>Small <b>trusted</b> kernel: it does <b>not</b> contain
<ul class="org-ul">
<li>Termination checker
</li>
<li>Fixpoint operators
</li>
<li>Pattern matching
</li>
</ul>
</li>
</ul>

</section>
<section id="sec-7" >

<h2>What is new?</h2>
<ul class="org-ul">
<li>Poweful <b>elaboration engine</b> that can handle
</li>
<li>Small <b>trusted</b> kernel
</li>
<li><b>Flexible</b> kernel
<ul class="org-ul">
<li>Proof irrelevance is optional
</li>
<li>Extensible (e.g., future support for HITs)
</li>
</ul>
</li>
</ul>

</section>
<section id="sec-8" >

<h2>What is new?</h2>
<ul class="org-ul">
<li>Poweful <b>elaboration engine</b> that can handle
</li>
<li>Small <b>trusted</b> kernel
</li>
<li><b>Flexible</b> kernel
</li>
<li>Multi-core support
<ul class="org-ul">
<li>Process theorems in parallel
</li>
<li>Execute/try tactics (automation) in parallel
</li>
</ul>
</li>
</ul>

</section>
<section id="sec-9" >

<h2>What is new?</h2>
<ul class="org-ul">
<li>Poweful <b>elaboration engine</b> that can handle
</li>
<li>Small <b>trusted</b> kernel
</li>
<li><b>Flexible</b> kernel
</li>
<li>Multi-core support
</li>
<li><b>Incremental compilation</b>
</li>
</ul>

</section>
<section id="sec-10" >

<h2>What is new?</h2>
<ul class="org-ul">
<li>Poweful <b>elaboration engine</b> that can handle
</li>
<li>Small <b>trusted</b> kernel
</li>
<li><b>Flexible</b> kernel
</li>
<li>Multi-core support
</li>
<li><b>Incremental compilation</b>
</li>
<li>Universe polymorphism
</li>
</ul>

</section>
<section id="sec-11" >

<h2>What is new?</h2>
<ul class="org-ul">
<li>Poweful <b>elaboration engine</b> that can handle
</li>
<li>Small <b>trusted</b> kernel
</li>
<li><b>Flexible</b> kernel
</li>
<li>Multi-core support
</li>
<li><b>Incremental compilation</b>
</li>
<li>Universe polymorphism
</li>
<li><b>Freedom to trust</b>
<ul class="org-ul">
<li>Support for "macros" (procedural attachments to kernel)
</li>
<li>Every "macro" can be <b>eliminated</b>
</li>
<li>Faster type checking and reduction
</li>
</ul>
</li>
</ul>

</section>
<section id="sec-12" >

<h2>What is new?</h2>
<ul class="org-ul">
<li>Poweful <b>elaboration engine</b> that can handle
</li>
<li>Small <b>trusted</b> kernel
</li>
<li><b>Flexible</b> kernel
</li>
<li>Multi-core support
</li>
<li><b>Incremental compilation</b>
</li>
<li>Universe polymorphism
</li>
<li><b>Freedom to trust</b>
</li>
<li>Support for <b>mixed</b> declarative and tactic <b>proof style</b>
</li>
<li>Future: <b>powerful automation</b>
</li>
</ul>


</section>
<section id="sec-13" >

<h2>What is new?</h2>
<ul class="org-ul">
<li>Poweful <b>elaboration engine</b> that can handle
</li>
<li>Small <b>trusted</b> kernel
</li>
<li><b>Flexible</b> kernel
</li>
<li>Multi-core support
</li>
<li><b>Incremental compilation</b>
</li>
<li>Universe polymorphism
</li>
<li><b>Freedom to trust</b>
</li>
<li>Support for <b>mixed</b> declarative and tactic <b>proof style</b>
</li>
<li>Future: <b>powerful automation</b>
</li>
</ul>

</section>
<section id="sec-14" >

<h2>The Logical Framework</h2>
<ul class="org-ul">
<li><b>First layer</b>: dependent lambda calculus
</li>
</ul>

<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">Type                      -- Sort
nat                       -- Constant
λ x : nat, x              -- Lambda abstraction
vector bool 3             -- Application
Π (n : nat), vector nat n -- Function Space
nat → bool                -- Function Space (no dependency)
</juicy-ace-editor>
</div>

</section>
<section id="sec-15" >

<h2>The Logical Framework</h2>
<ul class="org-ul">
<li><b>First layer</b>: dependent lambda calculus
</li>
</ul>

<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">definition f (A B : Type) : A → B → A :=
λ (a : A) (b : B), a

definition f (A B : Type) (a : A) (b : B) : A :=
a
</juicy-ace-editor>
</div>

</section>
<section id="sec-16" >

<h2>The Logical Framework</h2>
<ul class="org-ul">
<li><b>First layer</b>: dependent lambda calculus
</li>
<li>Hierarchy of universes
</li>
</ul>

<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">set_option pp.universes true
check Type.{0}  -- Prop     : Type.{1}
check Type.{1}  -- Type.{1} : Type.{2}
check Type.{2}  -- Type.{2} : Type.{3}
</juicy-ace-editor>
</div>

</section>
<section id="sec-17" >

<h2>The Logical Framework</h2>
<ul class="org-ul">
<li><b>First layer</b>: dependent lambda calculus
</li>
<li>Hierarchy of universes
</li>
<li><b>Prop</b> is the type of all <b>propositions</b>
</li>
</ul>

<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">theorem f (A B : Prop) : A → B → A :=
λ (a : A) (b : B), a

theorem f (A B : Prop) (a : A) (b : B) : A :=
a
</juicy-ace-editor>
</div>

</section>
<section id="sec-18" >

<h2>The Logical Framework</h2>
<ul class="org-ul">
<li><b>First layer</b>: dependent lambda calculus
</li>
<li>Hierarchy of universes
</li>
<li><b>Prop</b> is the type of all <b>propositions</b>
</li>
<li><b>Configurable</b>
<ul class="org-ul">
<li>Impredicative <b>Prop</b>
</li>
</ul>
<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">Π (x : nat), x = x  -- is a Proposition
∀ (x : nat), x = x  -- Alternative notation
</juicy-ace-editor>
</div>
<ul class="org-ul">
<li>Proof irrelevance
</li>
</ul>
<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">example (p : Prop) (H₁ : p) (H₂ : p) : H₁ = H₂ :=
rfl -- reflexivity
</juicy-ace-editor>
</div>
</li>

<li>We have <b>two flavors</b>
<ul class="org-ul">
<li>Standard (CoC): uses an impredicative and proof irrelevant <b>Prop</b>
</li>
<li>HoTT: proof relevant, and <b>no Prop</b>
</li>
</ul>
</li>
</ul>

</section>
<section id="sec-19" >

<h2>The Logical Framework</h2>
<ul class="org-ul">
<li><b>First layer</b>: dependent lambda calculus
</li>
<li>Hierarchy of universes
</li>
<li><b>Prop</b> is the type of all <b>propositions</b>
</li>
<li><b>Configurable</b>
</li>
<li>We have <b>two flavors</b>
</li>
<li><b>Second layer</b>: inductive families
<ul class="org-ul">
<li>We "believe" in recursion
</li>
</ul>
<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">inductive vector (A : Type) : nat → Type :=
| nil  : vector A zero
| cons : Π {n : nat}, A → vector A n → vector A (succ n)
</juicy-ace-editor>
</div>
</li>
</ul>

</section>
