20150218_MSR/index.org
* Inductive families

- Given
  #+BEGIN_SRC lean
  inductive nat : Type :=
  | zero : nat
  | succ : nat → nat
  #+END_SRC
- Produces
  #+BEGIN_SRC lean
  -- 1) A new type
  check nat
  -- 2) Introduction rules (aka Constructors)
  check nat.zero
  check nat.succ
  -- 3) Eliminator (aka Recursor)
  check @nat.rec
  -- 4) Computational rule
  variable C : nat → Type
  variable Hz : C nat.zero
  variable Hs : Π (a : nat), C a → C (nat.succ a)
  eval nat.rec Hz Hs nat.zero     -- Hz
  variable  a : nat
  eval nat.rec Hz Hs (nat.succ a) -- Hs a (nat.rec Hz Hs a)
  #+END_SRC

* Inductive families

  #+BEGIN_SRC lean
  definition pred (a : nat) : nat :=
  nat.rec nat.zero (λ (a₁ : nat) (r : nat), a₁) a

  eval pred (nat.succ (nat.succ nat.zero))
  -- => nat.succ nat.zero
  #+END_SRC

* Inductive families

- It is possible to *construct* a substantial *edifice of mathematics* based
  on nothing more than the *type universes*, *function spaces*, and
  *inductive types*; everything else follows from those.

  #+BEGIN_SRC lean
  inductive true : Prop :=
  intro : true

  inductive false : Prop  -- empty type

  inductive and (a b : Prop) : Prop :=
  intro : a → b → and a b

  inductive or (a b : Prop) : Prop :=
  | inl : a → or a b
  | inr : b → or a b

  inductive Exists (A : Type) (P : A → Prop) : Prop :=
  intro : Π (a : A), P a → Exists P

  inductive eq (A : Type) (a : A) : A → Prop :=
  refl : eq A a a
  #+END_SRC

* Inductive families

  #+BEGIN_SRC lean
  theorem and_comm (p q : Prop) (H : p ∧ q) : q ∧ p :=
  and.rec (λ Hp Hq, and.intro Hq Hp) H

  theorem and_comm (p q : Prop) (H : p ∧ q) : q ∧ p :=
  match H with
    and.intro Hp Hq := and.intro Hq Hp
  end

  definition swap (A B : Type) (p : A × B) : B × A :=
  match p with
    (a, b) := (b, a)
  end
  #+END_SRC

* Universe polymorphism

  #+BEGIN_SRC lean
  definition id.{u} (A : Type.{u}) (a : A) : A :=
  a

  definition arrow.{u₁ u₂} (A : Type.{u₁}) (B : Type.{u₂}) :
                   Type.{imax u₁ u₂} :=
  A → B

  check arrow.{0 0} true false
  check arrow.{1 1} nat nat
  check arrow.{1 0} nat true

  definition arrow (A : Type) (B : Type) : Type :=
  A → B

  check arrow nat true
  #+END_SRC

* Elaboration

  "By relieving the brain of all unnecessary work, a good notation sets it free to
   concentrate on more advanced problems, and in effect increases the mental power of the
   race." A. N. Whitehead

  - We want a *convenient system*
  - The following features are implemented *outside of the kernel*
    - Implicit arguments
    - Coercions
    - Namespace management
    - Ad-hoc polymorphism (overloading)
    - Type classes
    - Recursive equations
    - Dependent pattern matching
    - Human-readable proofs
    - Structures
    - Tactics (gateway to decision procedures, rewriters, ...)

* Implicit arguments

  - *Curly braces* indicate that argument should be *inferred* rather
    than entered explicitly.

  #+BEGIN_SRC lean
  definition id {A : Type} (a : A) : A :=
  a

  check id 10      -- @id num 10
  check @id num 10
  #+END_SRC

* Implicit arguments

  #+BEGIN_SRC lean
  check @eq.subst
  -- eq.subst : ∀ {A : Type} {a b : A} {P : A → Prop},
  --            a = b → P a → P b
  variables (A : Type)  (R : A → A → Prop)
  variables (a b c : A) (f : A → A → A)

  example (H₁ : R (f a a) (f a a)) (H₂ : a = b) :
          R (f a b) (f b a) :=
  eq.subst H₂ H₁

  example (H₁ : R (f a a) (f a a)) (H₂ : a = b) :
          R (f a b) (f b a) :=
  @eq.subst A a b (λ x : A, R (f a x) (f x a)) H₂ H₁
  #+END_SRC

* Definitional Reductions

  - Elaborator must respect the computational interpretation of terms
  #+BEGIN_SRC lean
  example (A : Type) (a b : A) : (a, b).1 = a :=
  rfl

  example (A B : Type) (f : A → A → B) (a : A) :
          (λ x, f x x) a = f a a :=
  rfl
  #+END_SRC

* Coercions

  - In Lean, we can associate *attributes* to definitions.
  - *Coercion* is one of the available attributes.

  #+BEGIN_SRC lean
  definition to_list [coercion]
             {A : Type} {n : nat} (v : vector A n) : list A :=
  vector.rec list.nil (λ n h t r, list.cons h r) v

  variable f : list nat → Prop
  variable v : vector nat 10
  check f v  -- f (@to_list nat 10 v)
  #+END_SRC

* Namespaces

  - We can group definitions, metaobjects (e.g., notation declarations) and attributes into namespaces.
  - We can *open* namespaces

  #+BEGIN_SRC lean
  namespace foo
    definition f (a : nat) := nat.succ a
    eval f nat.zero
  end foo

  eval foo.f nat.zero
  open foo
  eval f nat.zero

  open nat
  check 1 + 2

  open nat (hiding add sub)
  open nat (renaming add → nadd)
  open nat (rec_on)
  open [notations] nat
  open -[classes] nat
  #+END_SRC

* Ad-hoc polymorphism

  #+BEGIN_SRC lean
  notation a + b := add a b
  notation a + b := bor a b

  eval 1 + 2
  eval tt + ff
  #+END_SRC

  - We can use namespaces to avoid unwanted ambiguity.
  - We can *override* ad-hoc polymorphism

  #+BEGIN_SRC lean
  check (#nat a + b)
  #+END_SRC

* Type classes

  - *Synthesis* procedure based on *lambda-Prolog*

  - Big picture
    - Mark some inductive families as *classes*
    - Mark some definitions as (generators of) *instances*
    - Indicate that some implicit arguments must be synthesized using type classes

  - *Instances* are treated as *Horn clauses*

* Inhabited Type Class

  #+BEGIN_SRC lean
  inductive inhabited [class] (A : Type) : Type :=
  mk : A → inhabited A

  definition default (A : Type) [h : inhabited A] : A :=
  inhabited.rec (λ a, a) h

  definition prop_inhabited [instance] : inhabited Prop :=
  inhabited.mk true

  definition nat_inhabited [instance] : inhabited nat :=
  inhabited.mk nat.zero

  definition fun_inhabited [instance]
     (A B : Type) (h : inhabited B) : inhabited (A → B) :=
  inhabited.mk (λ x : A, default B)

  definition prod_inhabited [instance]
        (A B : Type) (ha : inhabited A) (hb : inhabited B) :
        inhabited (A × B) :=
  inhabited.mk (default A, default B)

  eval default (nat → nat × Prop)
  #+END_SRC

* Inhabited Type Class (Applications)

- Some propositions only hold for inhabited types
    #+BEGIN_SRC lean
    theorem ex_trivial (A : Type) [h : inhabited A] : ∃ x : A, x = x :=
    exists.intro (default A) rfl
    #+END_SRC

- "Corner cases"
    #+BEGIN_SRC lean
    definition head {A : Type} [h : inhabited A] (l : list A) : A :=
    list.rec (default A) (λ h t r, h) l
    #+END_SRC

