20150218_MSR/index.html
<section id="sec-20" >

<h2>Inductive families</h2>
<ul class="org-ul">
<li>Given
<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">inductive nat : Type :=
| zero : nat
| succ : nat → nat
</juicy-ace-editor>
</div>
</li>
<li>Produces
<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">-- 1) A new type
check nat
-- 2) Introduction rules (aka Constructors)
check nat.zero
check nat.succ
-- 3) Eliminator (aka Recursor)
check @nat.rec
-- 4) Computational rule
variable C : nat → Type
variable Hz : C nat.zero
variable Hs : Π (a : nat), C a → C (nat.succ a)
eval nat.rec Hz Hs nat.zero     -- Hz
variable  a : nat
eval nat.rec Hz Hs (nat.succ a) -- Hs a (nat.rec Hz Hs a)
</juicy-ace-editor>
</div>
</li>
</ul>

</section>
<section id="sec-21" >

<h2>Inductive families</h2>
<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">definition pred (a : nat) : nat :=
nat.rec nat.zero (λ (a₁ : nat) (r : nat), a₁) a

eval pred (nat.succ (nat.succ nat.zero))
-- =&gt; nat.succ nat.zero
</juicy-ace-editor>
</div>

</section>
<section id="sec-22" >

<h2>Inductive families</h2>
<ul class="org-ul">
<li>It is possible to <b>construct</b> a substantial <b>edifice of mathematics</b> based
on nothing more than the <b>type universes</b>, <b>function spaces</b>, and
<b>inductive types</b>; everything else follows from those.

<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">inductive true : Prop :=
intro : true

inductive false : Prop  -- empty type

inductive and (a b : Prop) : Prop :=
intro : a → b → and a b

inductive or (a b : Prop) : Prop :=
| inl : a → or a b
| inr : b → or a b

inductive Exists (A : Type) (P : A → Prop) : Prop :=
intro : Π (a : A), P a → Exists P

inductive eq (A : Type) (a : A) : A → Prop :=
refl : eq A a a
</juicy-ace-editor>
</div>
</li>
</ul>

</section>
<section id="sec-23" >

<h2>Inductive families</h2>
<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">theorem and_comm (p q : Prop) (H : p ∧ q) : q ∧ p :=
and.rec (λ Hp Hq, and.intro Hq Hp) H

theorem and_comm (p q : Prop) (H : p ∧ q) : q ∧ p :=
match H with
  and.intro Hp Hq := and.intro Hq Hp
end

definition swap (A B : Type) (p : A × B) : B × A :=
match p with
  (a, b) := (b, a)
end
</juicy-ace-editor>
</div>

</section>
<section id="sec-24" >

<h2>Universe polymorphism</h2>
<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">definition id.{u} (A : Type.{u}) (a : A) : A :=
a

definition arrow.{u₁ u₂} (A : Type.{u₁}) (B : Type.{u₂}) :
		 Type.{imax u₁ u₂} :=
A → B

check arrow.{0 0} true false
check arrow.{1 1} nat nat
check arrow.{1 0} nat true

definition arrow (A : Type) (B : Type) : Type :=
A → B

check arrow nat true
</juicy-ace-editor>
</div>

</section>
<section id="sec-25" >

<h2>Elaboration</h2>
<p>
"By relieving the brain of all unnecessary work, a good notation sets it free to
 concentrate on more advanced problems, and in effect increases the mental power of the
 race." A. N. Whitehead
</p>

<ul class="org-ul">
<li>We want a <b>convenient system</b>
</li>
<li>The following features are implemented <b>outside of the kernel</b>
<ul class="org-ul">
<li>Implicit arguments
</li>
<li>Coercions
</li>
<li>Namespace management
</li>
<li>Ad-hoc polymorphism (overloading)
</li>
<li>Type classes
</li>
<li>Recursive equations
</li>
<li>Dependent pattern matching
</li>
<li>Human-readable proofs
</li>
<li>Structures
</li>
<li>Tactics (gateway to decision procedures, rewriters, &#x2026;)
</li>
</ul>
</li>
</ul>

</section>
<section id="sec-26" >

<h2>Implicit arguments</h2>
<ul class="org-ul">
<li><b>Curly braces</b> indicate that argument should be <b>inferred</b> rather
than entered explicitly.
</li>
</ul>

<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">definition id {A : Type} (a : A) : A :=
a

check id 10      -- @id num 10
check @id num 10
</juicy-ace-editor>
</div>

</section>
<section id="sec-27" >

<h2>Implicit arguments</h2>
<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">check @eq.subst
-- eq.subst : ∀ {A : Type} {a b : A} {P : A → Prop},
--            a = b → P a → P b
variables (A : Type)  (R : A → A → Prop)
variables (a b c : A) (f : A → A → A)

example (H₁ : R (f a a) (f a a)) (H₂ : a = b) :
	R (f a b) (f b a) :=
eq.subst H₂ H₁

example (H₁ : R (f a a) (f a a)) (H₂ : a = b) :
	R (f a b) (f b a) :=
@eq.subst A a b (λ x : A, R (f a x) (f x a)) H₂ H₁
</juicy-ace-editor>
</div>

</section>
<section id="sec-28" >

<h2>Definitional Reductions</h2>
<ul class="org-ul">
<li>Elaborator must respect the computational interpretation of terms
</li>
</ul>
<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">example (A : Type) (a b : A) : (a, b).1 = a :=
rfl

example (A B : Type) (f : A → A → B) (a : A) :
	(λ x, f x x) a = f a a :=
rfl
</juicy-ace-editor>
</div>

</section>
<section id="sec-29" >

<h2>Coercions</h2>
<ul class="org-ul">
<li>In Lean, we can associate <b>attributes</b> to definitions.
</li>
<li><b>Coercion</b> is one of the available attributes.
</li>
</ul>

<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">definition to_list [coercion]
	   {A : Type} {n : nat} (v : vector A n) : list A :=
vector.rec list.nil (λ n h t r, list.cons h r) v

variable f : list nat → Prop
variable v : vector nat 10
check f v  -- f (@to_list nat 10 v)
</juicy-ace-editor>
</div>

</section>
<section id="sec-30" >

<h2>Namespaces</h2>
<ul class="org-ul">
<li>We can group definitions, metaobjects (e.g., notation declarations) and attributes into namespaces.
</li>
<li>We can <b>open</b> namespaces
</li>
</ul>

<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">namespace foo
  definition f (a : nat) := nat.succ a
  eval f nat.zero
end foo

eval foo.f nat.zero
open foo
eval f nat.zero

open nat
check 1 + 2

open nat (hiding add sub)
open nat (renaming add → nadd)
open nat (rec_on)
open [notations] nat
open -[classes] nat
</juicy-ace-editor>
</div>

</section>
<section id="sec-31" >

<h2>Ad-hoc polymorphism</h2>
<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">notation a + b := add a b
notation a + b := bor a b

eval 1 + 2
eval tt + ff
</juicy-ace-editor>
</div>

<ul class="org-ul">
<li>We can use namespaces to avoid unwanted ambiguity.
</li>
<li>We can <b>override</b> ad-hoc polymorphism
</li>
</ul>

<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">check (#nat a + b)
</juicy-ace-editor>
</div>

</section>
<section id="sec-32" >

<h2>Type classes</h2>
<ul class="org-ul">
<li><b>Synthesis</b> procedure based on <b>lambda-Prolog</b>
</li>

<li>Big picture
<ul class="org-ul">
<li>Mark some inductive families as <b>classes</b>
</li>
<li>Mark some definitions as (generators of) <b>instances</b>
</li>
<li>Indicate that some implicit arguments must be synthesized using type classes
</li>
</ul>
</li>

<li><b>Instances</b> are treated as <b>Horn clauses</b>
</li>
</ul>

</section>
<section id="sec-33" >

<h2>Inhabited Type Class</h2>
<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">inductive inhabited [class] (A : Type) : Type :=
mk : A → inhabited A

definition default (A : Type) [h : inhabited A] : A :=
inhabited.rec (λ a, a) h

definition prop_inhabited [instance] : inhabited Prop :=
inhabited.mk true

definition nat_inhabited [instance] : inhabited nat :=
inhabited.mk nat.zero

definition fun_inhabited [instance]
   (A B : Type) (h : inhabited B) : inhabited (A → B) :=
inhabited.mk (λ x : A, default B)

definition prod_inhabited [instance]
      (A B : Type) (ha : inhabited A) (hb : inhabited B) :
      inhabited (A × B) :=
inhabited.mk (default A, default B)

eval default (nat → nat × Prop)
</juicy-ace-editor>
</div>

</section>
<section id="sec-34" >

<h2>Inhabited Type Class (Applications)</h2>
<ul class="org-ul">
<li>Some propositions only hold for inhabited types
<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">theorem ex_trivial (A : Type) [h : inhabited A] : ∃ x : A, x = x :=
exists.intro (default A) rfl
</juicy-ace-editor>
</div>
</li>

<li>"Corner cases"
<div class="org-src-container">

<juicy-ace-editor mode="ace/mode/lean" theme="ace/theme/chrome" fontsize="20px">definition head {A : Type} [h : inhabited A] (l : list A) : A :=
list.rec (default A) (λ h t r, h) l
</juicy-ace-editor>
</div>
</li>
</ul>

</section>
